"""
Два различных натуральных числа n и m называются дружественными, если сумма делителей числа n
(включая 1, но исключая само n) равна числу m и наоборот. Например, 220 и 284 – дружественные числа.
По данному числу k выведите все пары дружественных чисел, каждое из которых не превосходит k. Программа
получает на вход одно натуральное число k, не превосходящее 105. Программа должна вывести все
пары дружественных чисел, каждое из которых не превосходит k. Пары необходимо выводить по одной в
строке, разделяя пробелами. Каждая пара должна быть выведена только один раз (перестановка чисел новую пару не дает).
Ввод:   Вывод:
300     220 284
"""

def sum_div(num):
    s = 0
    for el in range(1, num // 2 + 1):
        if num % el == 0:
            s += el
    return s

def func(k):
    res = []
    for i in range(1, k + 1):
        if i not in res:
            m = sum_div(i)
            if i == sum_div(m) and m != i:
                res.append(i)
                res.append(m)
    return res

print(func(10000))
